ERP.belugaerp/src/InformationRegisters/СоставыГруппПользователей/СоставыГруппПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоставыГруппПользователей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Используется</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ГруппаПользователей</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ИсторияИзмененийЗапретаРедактирования/бг_ИсторияИзмененийЗапретаРедактирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ИсторияИзмененийЗапретаРедактирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаЗапретаДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапретаПосле</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатыЗапрета</name>
    <comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.ВидыНазначенияДатЗапрета</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательКонечный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.ВидыНазначенияДатЗапрета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/ДатыЗапретаИзменения/ДатыЗапретаИзменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДатыЗапретаИзменения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаЗапрета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ОписаниеДатыЗапрета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions>
    <name>Раздел</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/СоставыГруппПользователей/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отбор.ГруппаПользователей.Использование
		И  Отбор.Пользователь.Использование Тогда
		
		Запрос = бг_ЗапросИсторияИзмененийЗапретаРедактирования();
		Выборка = Запрос.Выполнить().Выбрать();
		
		РегистрыСведений.бг_ИсторияИзмененийЗапретаРедактирования.ЗаписатьДанные(Выборка);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция бг_ЗапросИсторияИзмененийЗапретаРедактирования()

	ГруппаПользователей = Отбор.ГруппаПользователей.Значение;
	Пользователь = Отбор.Пользователь.Значение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставыГруппПользователей.ГруппаПользователей КАК ГруппаПользователей,
	|	СоставыГруппПользователей.Пользователь КАК Пользователь,
	|	СоставыГруппПользователей.Используется КАК Используется
	|ПОМЕСТИТЬ СоставыГруппПользователей
	|ИЗ
	|	&СоставыГруппПользователей КАК СоставыГруппПользователей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	СоставыГруппПользователей.ГруппаПользователей КАК ГруппаПользователей,
	|	СоставыГруппПользователей.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапретаДо,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапретаДо,
	|	НЕОПРЕДЕЛЕНО КАК ДатаЗапретаПосле,
	|	НЕОПРЕДЕЛЕНО КАК ОписаниеДатыЗапретаПосле
	|ПОМЕСТИТЬ ДатыЗапретаИзмененияДоПосле
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО ДатыЗапретаИзменения.Пользователь = СоставыГруппПользователей.ГруппаПользователей
	|			И (СоставыГруппПользователей.Используется)
	|ГДЕ
	|	СоставыГруппПользователей.ГруппаПользователей = &ГруппаПользователей
	|	И СоставыГруппПользователей.Пользователь = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел,
	|	ДатыЗапретаИзменения.Объект,
	|	ДатыЗапретаИзменения.Пользователь,
	|	СоставыГруппПользователей.Пользователь,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ДатыЗапретаИзменения.ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО ДатыЗапретаИзменения.Пользователь = СоставыГруппПользователей.ГруппаПользователей
	|			И (СоставыГруппПользователей.Используется)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	&ГруппаПользователей КАК Пользователь,
	|	ДатыЗапретаИзменения.Пользователь КАК ПользовательКонечный,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаДо) КАК ДатаЗапретаДо,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаДо) КАК ОписаниеДатыЗапретаДо,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаПосле) КАК ДатаЗапретаПосле,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаПосле) КАК ОписаниеДатыЗапретаПосле,
	|	""Изменен состав группы пользователей"" КАК Комментарий,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ГруппаПользователей) КАК ГруппаПользователей
	|ИЗ
	|	ДатыЗапретаИзмененияДоПосле КАК ДатыЗапретаИзменения
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыЗапретаИзменения.Раздел,
	|	ДатыЗапретаИзменения.Объект,
	|	ДатыЗапретаИзменения.Пользователь
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаДо) <> МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаПосле)
	|		ИЛИ МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаДо) <> МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаПосле))";
	
	Запрос.УстановитьПараметр("ГруппаПользователей", ГруппаПользователей);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("СоставыГруппПользователей", ЭтотОбъект.Выгрузить());
	
	Возврат Запрос;

КонецФункции

#КонецОбласти

#КонецЕсли
